In [1]:
%matplotlib inline
import pandas as pd
import numpy as np

In [3]:
tx = pd.read_csv('Taxi-cancellation-case.csv')

In [4]:
tx.head()

,row#,user_id,vehicle_model_id,package_id,travel_type_id,from_area_id,to_area_id,from_city_id,to_city_id,from_date,to_date,online_booking,mobile_site_booking,booking_created,from_lat,from_long,to_lat,to_long,Car_Cancellation
0,1,17712,12,NaN,2,1021.0,1323.0,NaN,NaN,1/1/13 22:33,NaN,0,0,1/1/13 8:01,13.028530,77.54625,12.869805,77.653211,0
1,2,17037,12,NaN,2,455.0,1330.0,NaN,NaN,1/1/13 12:43,NaN,0,0,1/1/13 9:59,12.999874,77.67812,12.953434,77.706510,0
2,3,761,12,NaN,2,814.0,393.0,NaN,NaN,1/2/13 0:28,1/3/13 0:00,1,0,1/1/13 12:14,12.908993,77.68890,13.199560,77.706880,0
3,4,868,12,NaN,2,297.0,212.0,NaN,NaN,1/1/13 13:12,NaN,0,0,1/1/13 12:42,12.997890,77.61488,12.994740,77.607970,0
4,5,21716,28,NaN,2,1237.0,330.0,NaN,NaN,1/1/13 16:33,NaN,0,0,1/1/13 15:07,12.926450,77.61206,12.858833,77.589127,0

In [5]:
tx.shape

(10000, 19)

In [6]:
tx.iloc[0]

row#                              1
user_id                       17712
vehicle_model_id                 12
package_id                      NaN
travel_type_id                    2
from_area_id                   1021
to_area_id                     1323
from_city_id                    NaN
to_city_id                      NaN
from_date              1/1/13 22:33
to_date                         NaN
online_booking                    0
mobile_site_booking               0
booking_created         1/1/13 8:01
from_lat                    13.0285
from_long                   77.5463
to_lat                      12.8698
to_long                     77.6532
Car_Cancellation                  0
Name: 0, dtype: object

In [7]:
tx.isnull().sum()

row#                      0
user_id                   0
vehicle_model_id          0
package_id             8248
travel_type_id            0
from_area_id             15
to_area_id             2091
from_city_id           6294
to_city_id             9661
from_date                 0
to_date                4178
online_booking            0
mobile_site_booking       0
booking_created           0
from_lat                 15
from_long                15
to_lat                 2091
to_long                2091
Car_Cancellation          0
dtype: int64

In [8]:
tx.Car_Cancellation.unique()

array([0, 1], dtype=int64)